src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <registerRecords>AccumulationRegister.ТранспортнаяЛогистикаДоставка</registerRecords>
  <attributes>
    <name>ДокументЛогистики</name>
    <type>
      <types>DocumentRef.ТранспортнаяЛогистика</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РейсПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставыРейсов</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВРейсе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресJSON</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыМаршрута</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Доверенность</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ТранспортнаяЛогистикаДоставка/ТранспортнаяЛогистикаДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТранспортнаяЛогистикаДоставка</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тоннаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВРейсе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.Доверенность</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПериодичностьУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПродукцияМаркируемаяДляГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТабачнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЕдиницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаГруппы</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МногооборотнаяТара</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВМесте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/МаршрутныйЛист/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЕстьНезаполненныеИлиНепровоедленныеРеализации = Ложь;
	Для Каждого СтрокаДокумент из ДокументыМаршрута цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДокумент.ДокументОтгрузки) тогда
			ЕстьНезаполненныеИлиНепровоедленныеРеализации = Истина;
			Прервать;
		КонецЕсли;
		
		Если НЕ СтрокаДокумент.ДокументОтгрузки.Проведен тогда
			ЕстьНезаполненныеИлиНепровоедленныеРеализации = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьНезаполненныеИлиНепровоедленныеРеализации И НЕ ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) тогда
		
		Сообщить("Нельзя проводить документ ""Маршрутный лист"" при не сформированных документах, или при непроведенных Реализациях!");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Дата",Дата-1);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	МаршрутныйЛистСоставыРейсов.Ссылка.Организация КАК Организация,
	|	МаршрутныйЛистСоставыРейсов.Ссылка.Маршрут КАК Маршрут,
	|	МаршрутныйЛистСоставыРейсов.Рейс КАК Рейс,
	|	МаршрутныйЛистСоставыРейсов.НомерВРейсе КАК НомерВРейсе,
	|	МаршрутныйЛистСоставыРейсов.ТочкаМаршрута КАК ТочкаМаршрута,
	|	МаршрутныйЛистСоставыРейсов.АдресПредставление КАК АдресПредставление,
	|	МаршрутныйЛистСоставыРейсов.ВремяНачала КАК ВремяЛогистикиНачало,
	|	МаршрутныйЛистСоставыРейсов.ВремяОкончания КАК ВремяЛогистикиОкончание,
	|	МаршрутныйЛистСоставыРейсов.GUID КАК GUID
	|ПОМЕСТИТЬ СоставыРейсов
	|ИЗ
	|	Документ.МаршрутныйЛист.СоставыРейсов КАК МаршрутныйЛистСоставыРейсов
	|ГДЕ
	|	МаршрутныйЛистСоставыРейсов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаршрутныйЛистДокументыМаршрута.ДокументОтгрузки КАК Документ,
	|	ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	СУММА(РеализацияТоваровУслугТовары.Номенклатура.ВесЕдиницы * РеализацияТоваровУслугТовары.Количество) КАК Тоннаж,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	|	ЕСТЬNULL(МаршрутныйЛистДокументыМаршрута.GUID, """") КАК GUID
	|ПОМЕСТИТЬ ДанныеРеализации
	|ИЗ
	|	Документ.МаршрутныйЛист.ДокументыМаршрута КАК МаршрутныйЛистДокументыМаршрута
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО МаршрутныйЛистДокументыМаршрута.ДокументОтгрузки = РеализацияТоваровУслугТовары.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|	И НЕ МаршрутныйЛистДокументыМаршрута.GUID ЕСТЬ NULL
	|	И МаршрутныйЛистДокументыМаршрута.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	МаршрутныйЛистДокументыМаршрута.ДокументОтгрузки,
	|	ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ЕСТЬNULL(МаршрутныйЛистДокументыМаршрута.GUID, """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставыРейсов.Организация КАК Организация,
	|	СоставыРейсов.Маршрут КАК Маршрут,
	|	СоставыРейсов.Рейс КАК Рейс,
	|	СоставыРейсов.НомерВРейсе КАК НомерВРейсе,
	|	СоставыРейсов.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ДанныеРеализации.Документ КАК ДокументДвижения,
	|	ДанныеРеализации.Номенклатура КАК Номенклатура,
	|	СУММА(ДанныеРеализации.Количество) КАК Количество,
	|	СУММА(ДанныеРеализации.Тоннаж) КАК Тоннаж,
	|	СоставыРейсов.АдресПредставление КАК АдресПредставление,
	|	СоставыРейсов.ВремяЛогистикиНачало КАК ВремяНачала,
	|	СоставыРейсов.ВремяЛогистикиОкончание КАК ВремяОкончания
	|ИЗ
	|	ДанныеРеализации КАК ДанныеРеализации
	|		ПОЛНОЕ СОЕДИНЕНИЕ СоставыРейсов КАК СоставыРейсов
	|		ПО ДанныеРеализации.GUID = СоставыРейсов.GUID
	|ГДЕ
	|	ДанныеРеализации.Документ.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	СоставыРейсов.Организация,
	|	СоставыРейсов.Маршрут,
	|	СоставыРейсов.Рейс,
	|	СоставыРейсов.НомерВРейсе,
	|	СоставыРейсов.ТочкаМаршрута,
	|	ДанныеРеализации.Номенклатура,
	|	ДанныеРеализации.Документ,
	|	СоставыРейсов.ВремяЛогистикиНачало,
	|	СоставыРейсов.ВремяЛогистикиОкончание,
	|	СоставыРейсов.АдресПредставление";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() тогда
		
		Выборка = Результат.Выбрать();
		ДвиженияТранспортнаяЛогистикаДоставка = Движения.ТранспортнаяЛогистикаДоставка;
		
		Пока Выборка.Следующий() Цикл
			
			НовоеДвижение = ДвиженияТранспортнаяЛогистикаДоставка.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовоеДвижение, Выборка);
			
			НовоеДвижение.Период = Дата;
			НовоеДвижение.Регистратор = Ссылка;
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
			НовоеДвижение.Водитель = Водитель;
			НовоеДвижение.Автомобиль = Автомобиль;
			НовоеДвижение.Пробег = Пробег;
			
		КонецЦикла;
		ДвиженияТранспортнаяЛогистикаДоставка.Записать();
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Заполнение даты документа
	ФиксированноеВремяДокументов.УстановитьВремяНовогоДокумента(ЭтотОбъект, Отказ);
	
	ЭтотОбъект.Рейсы.Сортировать("Рейс");
	ЭтотОбъект.СоставыРейсов.Сортировать("НомерВРейсе, ТочкаМаршрута, АдресПредставление, ВремяНачала, ВремяОкончания");
	
КонецПроцедуры
